In [1]:
import pandas as pd
import numpy as np

In [2]:
df_sp = pd.read_csv('../datasets/StudentsPerformance.csv')
df_sp

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [3]:
df_sp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [4]:
df_sp.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
df_sp.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [6]:
df_sp.shape

(1000, 8)

In [7]:
df_nf = pd.read_csv('../datasets/netflix_titles.csv')
df_nf

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
...,...,...,...,...,...,...,...,...,...,...,...,...
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,s8804,TV Show,Zombie Dumb,NaN,NaN,NaN,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

In [8]:
df_sp.T

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
gender,female,female,female,male,male,female,female,male,male,female,...,male,female,female,female,male,female,male,female,female,female
race/ethnicity,group B,group C,group B,group A,group C,group B,group B,group B,group D,group B,...,group E,group B,group D,group D,group A,group E,group C,group C,group D,group D
parental level of education,bachelor's degree,some college,master's degree,associate's degree,some college,associate's degree,some college,some college,high school,high school,...,high school,some high school,associate's degree,bachelor's degree,high school,master's degree,high school,high school,some college,some college
lunch,standard,standard,standard,free/reduced,standard,standard,standard,free/reduced,free/reduced,free/reduced,...,free/reduced,standard,free/reduced,free/reduced,standard,standard,free/reduced,free/reduced,standard,free/reduced
test preparation course,none,completed,none,none,none,none,completed,none,completed,none,...,completed,completed,none,none,none,completed,none,completed,completed,none
math score,72,69,90,47,76,71,88,40,64,38,...,86,65,55,62,63,88,62,59,68,77
reading score,72,90,95,57,78,83,95,43,64,60,...,81,82,76,72,63,99,55,71,78,86
writing score,74,88,93,44,75,78,92,39,67,50,...,75,78,76,74,62,95,55,65,77,86

In [9]:
df_sp.sort_index(axis=1,ascending=False,inplace=True)

In [10]:
df_sp

,writing score,test preparation course,reading score,race/ethnicity,parental level of education,math score,lunch,gender
0,74,none,72,group B,bachelor's degree,72,standard,female
1,88,completed,90,group C,some college,69,standard,female
2,93,none,95,group B,master's degree,90,standard,female
3,44,none,57,group A,associate's degree,47,free/reduced,male
4,75,none,78,group C,some college,76,standard,male
...,...,...,...,...,...,...,...,...
995,95,completed,99,group E,master's degree,88,standard,female
996,55,none,55,group C,high school,62,free/reduced,male
997,65,completed,71,group C,high school,59,free/reduced,female
998,77,completed,78,group D,some college,68,standard,female
999,86,none,86,group D,some college,77,free/reduced,female

In [11]:
df_sp.sort_values(by=['math score','reading score'],ascending=True)

,writing score,test preparation course,reading score,race/ethnicity,parental level of education,math score,lunch,gender
59,10,none,17,group C,some high school,0,free/reduced,female
980,23,none,24,group B,high school,8,free/reduced,female
17,28,none,32,group B,some high school,18,free/reduced,female
787,32,none,38,group B,some college,19,standard,female
145,33,none,39,group C,some college,22,free/reduced,female
...,...,...,...,...,...,...,...,...
625,99,completed,97,group D,some college,100,standard,male
149,93,completed,100,group E,associate's degree,100,free/reduced,male
458,100,none,100,group E,bachelor's degree,100,standard,female
916,100,completed,100,group E,bachelor's degree,100,standard,male
962,100,none,100,group E,associate's degree,100,standard,female

In [29]:
df_sp.loc[df_sp['math score'] > 95].iloc[3:6]

,writing score,test preparation course,reading score,race/ethnicity,parental level of education,math score,lunch,gender
149,93,completed,100,group E,associate's degree,100,free/reduced,male
165,100,completed,100,group C,bachelor's degree,96,standard,female
179,100,completed,100,group D,some high school,97,standard,female